var APP_DATA = {
  "scenes": [
    {
      "id": "0--",
      "name": "Первая очередь",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        },
        {
          "tileSize": 512,
          "size": 8192
        }
      ],
      "faceSize": 5334.5,
      "initialViewParameters": {
        "yaw": 2.4563546840708614,
        "pitch": 0.11045362248937707,
        "fov": 1.403086486818207
      },
      "linkHotspots": [
        {
          "yaw": 2.155147284402295,
          "pitch": 0.16360565669614857,
          "rotation": 6.283185307179586,
          "target": "1--"
        },
        {
          "yaw": 1.52223024137031,
          "pitch": 0.16690671291180692,
          "rotation": 4.71238898038469,
          "target": "3---684"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.4359575773458557,
          "pitch": -0.2460150840093398,
          "title": "Лихачёвский проспект, 76к1",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": 1.8526542873921663,
          "pitch": -0.23474526953907038,
          "title": "Лихачёвский проспект, 74к1",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": 2.8797551563928803,
          "pitch": -0.2661325116451714,
          "title": "Лихачёвский проспект, 80к1",
          "text": "Построен в 2007 году"
        },
        {
          "yaw": -3.0763904859539046,
          "pitch": -0.15234338561049832,
          "title": "Новый бульвар, 23",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": -2.4453611474103703,
          "pitch": -0.1509178798526385,
          "title": "Новый бульвар, 21",
          "text": "Построен в 2009 году"
        },
        {
          "yaw": -1.9769741689215046,
          "pitch": -0.1428685391390303,
          "title": "Новый бульвар, 19",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": -1.4903906320343339,
          "pitch": -0.12837414608539177,
          "title": "Новый бульвар, 15",
          "text": "Построен в 2008 году"
        },
        {
          "yaw": 0.3009953961364875,
          "pitch": -0.3809033961612478,
          "title": "Лихачёвский проспект, 74к2",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": 2.4961616747546334,
          "pitch": 0.6824413923107979,
          "title": "Новый бульвар, 21к3",
          "text": "Школа №14. Построена в 2007 году"
        },
        {
          "yaw": -1.1529306987461343,
          "pitch": 0.27665906630515025,
          "title": "Новый бульвар, 19к1",
          "text": "Детский сад №13. Построен в 2014 году"
        }
      ]
    },
    {
      "id": "1--",
      "name": "Лихачёвский проспект",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        },
        {
          "tileSize": 512,
          "size": 8192
        }
      ],
      "faceSize": 5356,
      "initialViewParameters": {
        "yaw": 0.8726646259971602,
        "pitch": 0.05162473276072532,
        "fov": 1.403086486818207
      },
      "linkHotspots": [
        {
          "yaw": -0.007115849682708841,
          "pitch": 0.21747536694120662,
          "rotation": 0.7853981633974483,
          "target": "0--"
        },
        {
          "yaw": -1.0796566828786194,
          "pitch": 0.23302737267933793,
          "rotation": 5.497787143782138,
          "target": "2--"
        },
        {
          "yaw": 1.0214902217027735,
          "pitch": 0.18720615808932628,
          "rotation": 1.5707963267948966,
          "target": "3---684"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.3202906314814751,
          "pitch": -0.21132705503264937,
          "title": "Лихачёвский проспект, 80к1",
          "text": "Построен в 2007 году"
        },
        {
          "yaw": -0.11741941510076082,
          "pitch": -0.3017462530033388,
          "title": "Лихачёвский проспект, 76к1",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": 0.30558732278053213,
          "pitch": -0.3004402580761045,
          "title": "Лихачёвский проспект, 74к1",
          "text": "Построен в 2006 году"
        },
        {
          "yaw": 1.410130657461103,
          "pitch": -0.25601499128051586,
          "title": "Лихачёвский проспект, 70к1",
          "text": "Построен в 2008 году"
        },
        {
          "yaw": 1.8246259359044519,
          "pitch": -0.22944556936278815,
          "title": "Лихачёвский проспект, 68к1",
          "text": "Построен в 2008 году"
        },
        {
          "yaw": 0.8436753905678973,
          "pitch": 0.6505474077045221,
          "title": "Бульвар Воздухоплавателей",
          "text": ""
        },
        {
          "yaw": 1.0770239510841648,
          "pitch": 1.2068375163215421,
          "title": "Лихачёвский проспект",
          "text": ""
        },
        {
          "yaw": -0.2776784115841924,
          "pitch": 0.3125275204108213,
          "title": "Лихачёвский проспект, 74",
          "text": "ТЦ \"Город\". Построен в 2019 году"
        },
        {
          "yaw": -1.0001425258789354,
          "pitch": 0.4409865838675504,
          "title": "Лихачёвское шоссе, 1к1",
          "text": "Торговый центр. Построен в 2013 году"
        }
      ]
    },
    {
      "id": "2--",
      "name": "Общежития ДНПП",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        },
        {
          "tileSize": 512,
          "size": 8192
        }
      ],
      "faceSize": 5332.5,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 1.6842381162024358,
          "pitch": 0.25515547236495806,
          "rotation": 0.7853981633974483,
          "target": "1--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.0673726251621067,
          "pitch": 0.11041901277260813,
          "title": "Лихачёвское шоссе, 1к2",
          "text": "Построен в 2004 году"
        },
        {
          "yaw": 1.3001068921805334,
          "pitch": 0.11977918023486644,
          "title": "Лихачёвское шоссе, 1А",
          "text": "Построен в 1991 году"
        },
        {
          "yaw": 0.6977817541653693,
          "pitch": 0.8790731660614117,
          "title": "Лихачёвское шоссе, 1Г",
          "text": ""
        },
        {
          "yaw": 0.05775542628650143,
          "pitch": 0.1089375724614925,
          "title": "Лихачёвское шоссе, 1Б",
          "text": "Построен в 1997 году"
        },
        {
          "yaw": -0.32893344241458067,
          "pitch": 0.17229300809569636,
          "title": "Лихачёвское шоссе, 1В",
          "text": "Построен в 1999 году"
        },
        {
          "yaw": -3.108871611570713,
          "pitch": -0.3756434950634837,
          "title": "Лихачёвское шоссе, 1к5",
          "text": "Построен в 2012 году"
        },
        {
          "yaw": -1.3857892087960444,
          "pitch": -0.2201235092312963,
          "title": "Лихачёвское шоссе, 1к4",
          "text": "Построен в 2009 году"
        }
      ]
    },
    {
      "id": "3---684",
      "name": "Лихачёвский проспект, 68к4",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        },
        {
          "tileSize": 512,
          "size": 8192
        }
      ],
      "faceSize": 5334.5,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.5004708667815656,
          "pitch": 0.13025383123972034,
          "rotation": 1.5707963267948966,
          "target": "0--"
        },
        {
          "yaw": -0.28911942451051686,
          "pitch": 0.09033289026387692,
          "rotation": 0,
          "target": "1--"
        },
        {
          "yaw": 2.331854271097404,
          "pitch": 0.2614719653311557,
          "rotation": 1.5707963267948966,
          "target": "4---685"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.17228007438174586,
          "pitch": -0.4415237109091237,
          "title": "Лихачёвский проспект, 70к1",
          "text": "Построен в 2008 году"
        },
        {
          "yaw": 0.9428278751374233,
          "pitch": -0.5590373254073295,
          "title": "Лихачёвский проспект, 70к2",
          "text": "Построен в 2009 году"
        },
        {
          "yaw": -2.0796044877029694,
          "pitch": 0.04596951327129695,
          "title": "Лихачёвский проспект, 68к4",
          "text": "Построен в 2009 году"
        },
        {
          "yaw": 0.17503860905774538,
          "pitch": 0.47400367446087266,
          "title": "Лихачёвский проспект, 68к3",
          "text": "Детский сад №3. Построен в 2012 году"
        }
      ]
    },
    {
      "id": "4---685",
      "name": "Лихачёвский пропект, 68к5",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        },
        {
          "tileSize": 512,
          "size": 8192
        }
      ],
      "faceSize": 5338.5,
      "initialViewParameters": {
        "yaw": 2.2943521955960637,
        "pitch": 0.026220381963828032,
        "fov": 1.403086486818207
      },
      "linkHotspots": [
        {
          "yaw": 1.6298566876579992,
          "pitch": 0.2538461121387705,
          "rotation": 0,
          "target": "3---684"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.370293109112545,
          "pitch": 0.050086914250279335,
          "title": "Лихачёвский проспект, 68к5",
          "text": "Построен в 2013 году"
        },
        {
          "yaw": 2.008077310185363,
          "pitch": 0.11068861662667118,
          "title": "Лихачёвский проспект, 70к3",
          "text": "Построен в 2010 году"
        },
        {
          "yaw": -2.5010403404964556,
          "pitch": 0.1764411410969462,
          "title": "Лихачёвский проспект, 70к4",
          "text": "Построен в 2009 году"
        },
        {
          "yaw": -1.155592996215919,
          "pitch": 0.5093555076439849,
          "title": "Бульвар им. Умберто Нобиле, 3",
          "text": "Детский сад №3. Построен в 2021 году"
        }
      ]
    }
  ],
  "name": "Долгопрудный в Minecraft",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": true,
    "viewControlButtons": false
  }
};
